[
  {
    "Id": 2,
    "Name": "Pico de Gallo",
    "Source": "From the Potts Family Recipes",
    "PrepTime": "30 minutes",
    "WaitTime": "None",
    "CookTime": "60 minutes",
    "Servings": 8,
    "RecipeIngredients": "6 small tomatoes diced into small pieces (4 medium or 3 large)\n1 medium sweet onion diced into small pieces\n3 stalks of green onion sliced thin\n3 cloves of garlic minced\n1 handful of Cilantro cut up into small pieces\n2 to 3 medium sized Serrano Chili’s minced\nJuice from 1 lemon or lime\nSea Salt to taste\n1 avocado diced if desired (will cool down the heat)",
    "Comments": "1. In large mixing bowl combine all ingredients and mix until well blended.\n2. Chili for at least 60 minutes prior to serving.\n\nGreat as a garnish for Mexican food or for use as a dip with tortilla chips.",
    "Instructions": "1. In large mixing bowl combine all ingredients and mix until well blended.\n2. Chili for at least 60 minutes prior to serving.\n\nGreat as a garnish for Mexican food or for use as a dip with tortilla chips.",
    "Photo": "/upload/image/vfsvtzwf.png"
  },
  {
    "Id": 3,
    "Name": "Mexican Rice",
    "Source": "From the Potts Family Recipes",
    "PrepTime": "5 minutes",
    "WaitTime": "",
    "CookTime": "25 minutes",
    "Servings": 4,
    "RecipeIngredients": "2 cups extra long grain white rice\n2 knorr bouillon cubes – use flavor that will go with main dish\n4 cups of water\n1 teaspoon cumin\n4 ounces of tomato sauce\n2 tablespoons of butter or margarine",
    "Comments": "",
    "Instructions": "1. In a large skillet that has a lid.\n2. Melt the butter or margarine and then add rice.\n3. Cook the rice until it starts to turn brown.\n4. Add Cumin and tomato sauce and mix together.\n5. Add bouillon and water and stir to combine.\n6. Bring mixture to a boil stirring constantly.\n7. Reduce heat to low and cover.\n8. Let cook until rice is tender and cooked.",
    "Photo": "/upload/image/0a5mpmpw.png"
  },
  {
    "Id": 4,
    "Name": "Chicken Enchiladas",
    "Source": "From the Potts Family Recipes",
    "PrepTime": "30 minutes",
    "WaitTime": "",
    "CookTime": "60 minutes",
    "Servings": 4,
    "RecipeIngredients": "1 ½ to 2 dozen Corn Tortillas\n4 Chicken Breasts\n1 teaspoon poultry seasoning\n2 bay leaves\n1 cup white onions, diced\n1 small can sliced or chopped black olives\n1 small can diced green chili’s\n4 cups shredded Cheddar Cheese\n1 – 15 oz can tomato sauce\n1 – 8 oz can tomato sauce\n6 tablespoons of Chili powder\n2 cloves garlic\nSalt and Pepper",
    "Comments": "",
    "Instructions": "1. Preheat oven to 350 degrees.\n2. Clean Chicken and pat dry.\n3. Sprinkle the poultry seasoning into along with the bay leaves into a large pot of water and add Chicken.\n4. Par Boil Chicken for at least 30 minutes or until the Chicken is cooked through.\n5. Drain water and set aside to cool.\n6. In a sauce pan add tomato sauce, chili powder and garlic.\n7. Cook over medium heat and stir until mixture becomes bubbly.\n8. Remove from heat placing a thin layer of sauce at the bottom of a 9 x 13 baking dish.\n9. Set remainder aside for later.\n10. Once the chicken has cooled shred it up and add onions, black olives, green chili’s, ½ the cheddar cheese and salt and pepper.\n11. To soften corn tortillas, place tortilla in frying pay and turn over after about 15 seconds over medium heat.\n12. Put about ¼ cup of the chicken mixture on tortilla and roll.\n13. Place into a 9x13 inch baking pan.\n14. Repeat until all of the chicken mixture is gone.\n15. Take remaining sauce and pour over rolled chicken tortillas.\n16. Sprinkle remaining cheddar cheese on top and cover with foil.\n17. Bake for 30 minutes or until cheese is melted and bubbly.\n\nMakes about 18 to 24 enchiladas.",
    "Photo": "/upload/image/qxbcoh41.png"
  },
  {
    "Id": 5,
    "Name": "Strawberry Compote",
    "Source": "From the Potts Family Recipes",
    "PrepTime": "15 minutes",
    "WaitTime": "",
    "CookTime": "30 minutes",
    "Servings": 4,
    "RecipeIngredients": "2 cups ripe Strawberries\n1 tablespoon fresh squeezed Lemon juice\n½ cup granulated Sugar\n½ teaspoon Lemon zest\n1 teaspoon Cornstarch",
    "Comments": "",
    "Instructions": "1. Clean and chop up ripe Strawberries into 8 to 12 pieces each.\n2. Add Strawberries, Sugar, and Lemon juice to a saucepan and mix over medium heat for 1 to 1.5 minutes.\n3. Lower the heat to low and simmer for 20 minutes mixing occasionally.\n4. Mix the Cornstarch with a little bit of water in a small ramakin and then add to the sauce mixture continually stirring for 2 to 3 minutes.\n5. Remove from heat and cool for 20 to 30 minutes.\n6. Place finished compote into a storage container and store in refrigerator.\n7. Once compote is cold it is ready for use.",
    "Photo": "/upload/image/sdcbhbhj.png"
  },
  {
    "Id": 7,
    "Name": "Marble Cupcakes",
    "Source": "From the Potts Family Recipes",
    "PrepTime": "40 minutes",
    "WaitTime": "",
    "CookTime": "20 minutes",
    "Servings": 12,
    "RecipeIngredients": "Base:\n1 cup all-purpose flour \n1 cup granulated sugar \n1 ½ teaspoon baking powder \n½ teaspoon salt \n¼ teaspoon baking soda \n¾ cup unsalted butter, melted \n½ cup sour cream, room temperature \n½ cup water, room temperature \n3 large egg whites, room temperature \n1 tablespoon vanilla extract \n\nAdd-In for Vanilla Cupcake Batter: \n¼ cup all-purpose flour \n\nAdd-In for Chocolate Cupcake Batter: \n¼ cup unsweetened cocoa powder \n\nVanilla Buttercream Frosting: \n½ cup unsalted butter, room temperature \n½ tablespoon vanilla extract \n¼ teaspoon salt \n1 ¾ cups powdered sugar \n¼ cup heavy cream \n\nChocolate Buttercream Frosting: \n½ cup unsalted butter, room temperature \n½ tablespoon vanilla extract \n¼ teaspoon salt \n1 ¾ cups powdered sugar \n½ cup unsweetened cocoa powder \n¼ cup plus 2 tablespoons heavy cream",
    "Comments": "",
    "Instructions": "Marble Cupcake\n1. Preheat oven to 350 degrees.\n2. Line muffin pans with 16 paper liners and set aside.\n3. In a large bowl on a stand mixer, add the melted butter, sour cream, water, egg whites, and vanilla extract and whisk together on medium speed until combined and smooth.\n4. Sift the flour, sugar, baking powder, salt, and baking soda into a medium bowl.\n5. Add dry ingredients to the wet ingredients until all incorporated while whisking on medium low speed.\n6. Pour 1 ½ cups of the batter into another mixing bowl and set aside.\n7. In the remaining 2 ½ cups of the batter on the mixer add the add-in flour and whisk until incorporated and smooth.\n8. In the second mixing bowl with the 1 ½ cups of batter add the add-in cocoa powder and whisk until smooth and pour into a resealable plastic bag.\n9. Pour the vanilla batter into the cupcake liner ½ full, then cut a small bottom corner of the reusable plastic bag and squeeze 3 to 4 separate drops of the chocolate batter into the cupcake liner until liner is ¾ full.\n10. Using a thin metal spatula or chop stick swirl the chocolate batter through the vanilla batter making sure to not overmix it.\n11. Bake for 18-22 minutes or until a cake tester inserted in the center comes out clean.  Rotate after 10 minutes to help the cupcakes bake evenly.\n12. Allow to cool in pan for 10 minutes and then remove to a wire cooling rack until completely cool – about an hour.\n13. While waiting for the cupcakes to cool work on the Buttercream frosting.\n\nButtercream Frosting:\n1. In a large bowl on a stand mixer add butter and mix on medium speed for 30 seconds using the paddle attachment.\n2. Add vanilla, and salt and mix on low speed until combined.\n3. For the vanilla buttercream frosting, slowly mix in the powdered sugar and heavy cream on low speed until all ingredients are incorporated, and the desired consistency is reached.\n4. For the chocolate buttercream frosting, slowly mix in the powdered sugar and ¾ of the heavy cream on low speed until all ingredients are incorporated. Next add cocoa powder, and remaining heavy cream into the frosting and mix until the ingredients are fully incorporated, and the desired consistency is reached.\n5. Fit a large piping bag with a large frosting tip of your choice.\n6. Fill the piping bag with the frosting flavor you made.\n7. Swirl the frosting onto the completely cooled cupcakes and enjoy. ",
    "Photo": "/upload/image/zxpviaaa.png"
  },
  {
    "Id": 8,
    "Name": "Pork Katsu",
    "Source": "From the Potts Family Recipes",
    "PrepTime": "15 minutes",
    "WaitTime": "",
    "CookTime": "15 minutes",
    "Servings": 5,
    "RecipeIngredients": "4 to 6 pieces boneless center cut pork loin chops \n½ cup all-purpose flour \n½ cup cornstarch \n3 large eggs \n3 tablespoons water \n1 cup panko bread crumbs \n3 teaspoons sea salt \n2 teaspoons black pepper \nPeanut oil",
    "Comments": "",
    "Instructions": "1. Assemble a breading station with 3 containers:\n     a. In container on left add flour, cornstarch, 1 teaspoon of salt, and ½ teaspoon black pepper and mix together.\n     b. In container in the middle add eggs and water and whisk till combined completely.\n     c. In container on the right add panko, 2 teaspoons salt, and 1 ½ teaspoons black pepper and mix together.\n\n2. Prep the pork by placing 1 piece of the pork into a resealable bag and using a meat tenderizer smash until about ¼ inch thick, repeat for remaining pieces.\n\n3. Place a large pan on stove and add peanut oil until it is ¼ inch deep, and heat at medium heat.\n\n4. Coat each piece of pork with the flour mixture, then dredge through the egg mixture, then into the panko mixture, and then place into the waiting hot pan.\n\n5. Cook for 5 to 7 minutes or until crispy and golden brown, and then turn and cook for another 5 to 7 minutes or until crispy and golden brown, and then remove to a wire rack in a flat baking pan with paper towels lining the pan.\n\n6. Let rest for 5 minutes, then serve. ",
    "Photo": "/upload/image/dbjyhvb3.png"
  },
  {
    "Id": 9,
    "Name": "Guacamole",
    "Source": "From the Potts Family Recipes",
    "PrepTime": "20 Minutes",
    "WaitTime": "",
    "CookTime": "",
    "Servings": 0,
    "RecipeIngredients": "3 Haas avocadoes, halved, seeded and peeled \n1 lime, juiced \n½ teaspoon kosher salt \n½ teaspoon ground cumin \n½ teaspoon cayenne \n½ medium red onion, diced \n½ Jalapeno pepper, seeded and minced \n2 Roma Tomatoes, seeded and diced \n1 tablespoon chopped cilantro \n1 clove garlic, minced ",
    "Comments": "",
    "Instructions": "1. In a large bowl place the scooped avocado pulp and lime juice, toss to coat.\n2. Drain, and reserve the lime juice, after all of the avocadoes have been coated.\n3. Using a potato masher add the salt, cumin, and cayenne and mash.\n4. Then, fold in the onions, tomatoes, cilantro, and garlic.\n5. Add 1 tablespoon of the reserved lime juice. ",
    "Photo": "/upload/image/5gh1cxib.png"
  },
  {
    "Id": 10,
    "Name": "Chocolate Espresso Cupcakes",
    "Source": "From the Potts Family Recipes",
    "PrepTime": "30 Minutes",
    "WaitTime": "",
    "CookTime": "35 Minutes",
    "Servings": 0,
    "RecipeIngredients": "CUPCAKES\n1 cup all-purpose flour \n1 cup sugar \n½ cup unsweetened cocoa powder \n1 teaspoon baking powder \n½ teaspoon baking soda \n½ teaspoon kosher salt \n1 teaspoon espresso powder \n½ cup milk \n1 large egg \n½ teaspoon vanilla extract \n½ cup boiling water \n\nFROSTING\n1 ½ sticks butter, softened \n½ cup unsweetened cocoa powder \n2 ½ cups powdered sugar \n¼ cup whole milk \n1 teaspoons vanilla extract \n½ teaspoon espresso powder ",
    "Comments": "",
    "Instructions": "CUPCAKES\n1. Preheat oven to 350 degrees.  Put uncooked ride in bottom of muffin tins.  Line muffin tin with cupcake liners.\n2. Whisk all dry ingredients together in mixing bowl on stand mixer with whisk attachment.\n3. Add Milk, oil, egg, and vanilla extract to the mixing bowl and mix until well incorporated.\n4. Carefully add the boiling water to the mixing bowl and mix until well combined and the batter is smooth and lump free. Batter should be fairly runny.\n5. Fill cupcake liner ½ full making sure to evenly distribute batter between all 12 liners.\n6. Bake for 20 minutes or until a toothpick inserted into the center comes out clean and the cupcakes are completely cooked.\n7. Allow Cupcakes to cool completely.\n8. Frost with your favorite frosting and enjoy. \n\nFROSTING\n1. In a large mixing bowl on stand mixer, add cocoa powder and whisk to remove lumps. \n2. Add butter and cream until completely combined with the whisk attachment. \n3. In a large bowl add the powdered sugar and whisk to remove lumps. \n4. Add the powdered sugar to the butter mixture 1 cup at a time with about a tablespoon of milk at each addition. \n5. Add the vanilla extract and espresso powder and continue to mix until all ingredients and well combined. \n6. If frosting is dry continue to add 1 tablespoon of milk at a time till you achieve a desired consistency. \n7. Place frosting into a piping bag and frost cupcakes or cake when they are completely cool. ",
    "Photo": "/upload/image/tzv5dpl0.png"
  },
  {
    "Id": 11,
    "Name": "Corn Chowder",
    "Source": "From the Potts Family Recipes",
    "PrepTime": "15 Minutes",
    "WaitTime": "",
    "CookTime": "45 Minutes",
    "Servings": 8,
    "RecipeIngredients": "1 Medium Onion diced \n6 Slices of Bacon cut into ½ inch strips \n1 Can Creamed Corn \n2 – 3 Potatoes diced into ½ inch cubes \n1 Cup Heavy Cream \n2 Cups Whole Milk \n2 teaspoon Sea Salt \n½ teaspoon Black Pepper ",
    "Comments": "",
    "Instructions": "1. In a large pot brown the cut up bacon until nice and golden brown. \n2. Add the diced onions to the bacon and sauté until the onions are translucent. \n3.Next add the potatoes and mix up and keep cooking for 7 to 10 minutes. \n4. Now add the creamed corn and mix together until everything is well blended. \n5. Add the heavy cream, milk, salt, and pepper. \n6. Allow to simmer for 30 minutes or until the potatoes are tender. ",
    "Photo": "/upload/image/dkmmjs5n.png"
  },
  {
    "Id": 12,
    "Name": "Crispy Baked Chicken Wings",
    "Source": "Tastes Better From Scratch",
    "PrepTime": "10 Minutes",
    "WaitTime": "",
    "CookTime": "60 Minutes",
    "Servings": 6,
    "RecipeIngredients": "4 pounds chicken wings , halved at joints, wingtips discarded\n2 Tablespoons baking powder* , aluminum free\n3/4 teaspoon salt\n1/2 teaspoon cracker black pepper\n1 teaspoon paprika\n1 teaspoon garlic powder",
    "Comments": "",
    "Instructions": "1. Adjust your oven rack to the upper-middle position. Preheat oven to 425 degrees F. \n2. Line a baking sheet with aluminum foil and place a wire rack (I use a cooling rack) on top. Spray the rack with non-stick spray.\n3. Use paper towels to pat the wings dry and place them in a large bowl. It's important to dry them REALLY well!\n4. Combine the salt, pepper, garlic powder, paprika, and baking powder in a small bowl. Then sprinkle the seasoning over the wings, tossing to evenly coat.\n5. Arrange wings, skin side up, in single layer on prepared wire rack.\n6. Bake on the upper middle oven rack, turning every 20 minutes until wings are crispy and browned. The total cook time will depend on the size of the wings but may take up to 1 hour.\n7. Remove from oven and let stand for 5 minutes. Transfer wings to bowl and toss with sauce.",
    "Photo": "/upload/image/avd02xyp.png"
  }
]
